app/controllers/friends_controller.rb

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "phone" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "780-000-2222"], ["updated_at", "2020-12-05 06:10:04.422484"], ["id", 4]]